#+title: polynomials in J

* polynomials in J

Suppose we have (a small sample of) the number line:

#+begin_src J :session j
  [ x =: i: 19 - 10
#+end_src
#+RESULTS:
: _9 _8 _7 _6 _5 _4 _3 _2 _1 0 1 2 3 4 5 6 7 8 9

Here's a polynomial:

#+begin_src J :session j
  _3 + 2*x + 4*x^2
#+end_src
#+RESULTS:
: 627 493 375 273 187 117 63 25 3 _3 7 33 75 133 207 297 403 525 663

* NOTE . multiplying polynomials
:PROPERTIES:
:TS:       <2014-05-31 01:59PM>
:ID:       s23i5m702ig0
:END:

A polynomial is of the form:

#+begin_src J
  a =: 1 2 3 4
  ([: +/ a * (i. # a) ^~ ]) 10
#+end_src
#+RESULTS:
: 4321

#+begin_src J
  3 1 ([:+/ /. */) &|. 2 1 3
#+end_src
#+RESULTS:
: 3 10 5 6



